Tekla Open API Reference for Tekla Structures 2025
Events.DrawingEditorOpenedDelegate Delegate
 The delegate to use for drawing editor opening.
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public delegate void DrawingEditorOpenedDelegate()
Public Delegate Sub DrawingEditorOpenedDelegate
See Also
Reference
Tekla.Structures.Drawing.UI Namespace